Revit 2027 API
FamilyManager.Parameter(BuiltInParameter) Property
Obtains the parameter of this type with a given parameter id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyParameter this[
	BuiltInParameter parameterId
] { get; }
Public ReadOnly Property Parameter (
	parameterId As BuiltInParameter
) As FamilyParameter
	Get
public:
property FamilyParameter^ Parameter[BuiltInParameter parameterId] {
	FamilyParameter^ get (BuiltInParameter parameterId);
}
member Parameter : FamilyParameter with get
Parameters
parameterId BuiltInParameter
Property Value
FamilyParameter
Remarks
Returns null if the parameter is not found.
See Also
Reference
FamilyManager Class
Parameter Overload
Autodesk.Revit.DB Namespace